bbrauchl/EK-TM4C123G-uCOS-III/Software/EvalBoards/TI/DK-TM4C123X/BSP/KeilMDK/cstartup.s
;
;********************************************************************************************************
;                                    EXCEPTION VECTORS & STARTUP CODE
;
; File      : cstartup.s
; For       : Cortex-M4
; Mode      : Thumb2
; Toolchain : RealView Development Suite
;             RealView Microcontroller Development Kit (MDK)
;             ARM Developer Suite (ADS)
;             Keil uVision
;********************************************************************************************************
;

;/*
;********************************************************************************************************
;*                           <<< Use Configuration Wizard in Context Menu >>>
;*
;* Note(s) : (1) The µVision4 Configuration Wizard enables menu driven configuration of assembler,
;*               C/C++, or debugger initialization files. The Configuration Wizard uses control items
;*               that are embedded into the comments of the configuration file.
;*
;********************************************************************************************************
;*/

;/*
;********************************************************************************************************
;*                                              STACK DEFINITIONS
;*
;* Configuration Wizard Menu:
;* // <h> Stack Configuration
;* //   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
;* // </h>;
;*********************************************************************************************************
;*/

Stack_Size      EQU     0x00000200

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


;/*
;********************************************************************************************************
;*                                               HEAP DEFINITIONS
; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>
;*********************************************************************************************************
;*/

Heap_Size       EQU     0x00000000

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit


                PRESERVE8
                THUMB


                                                                ; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size
    
                IMPORT  OS_CPU_PendSVHandler
                IMPORT  OS_CPU_SysTickHandler

__Vectors       DCD     __initial_sp                            ;   0 Top of Stack
                DCD     Reset_Handler                           ;   1 Reset Handler
                DCD     App_NMI_ISR                             ;   2 NMI Handler
                DCD     App_Fault_ISR                           ;   3 Hard Fault Handler
                DCD     App_MemFault_ISR                        ;   4 MPU Fault Handler
                DCD     App_BusFault_ISR                        ;   5 Bus Fault Handler
                DCD     App_UsageFault_ISR                      ;   6 Usage Fault Handler
                DCD     App_Spurious_ISR                        ;   7 Reserved
                DCD     App_Spurious_ISR                        ;   8 Reserved
                DCD     App_Spurious_ISR                        ;   9 Reserved
                DCD     App_Spurious_ISR                        ;  10 Reserved
                DCD     App_Spurious_ISR                        ;  11 SVCall Handler
                DCD     App_Spurious_ISR                        ;  12 Debug Monitor Handler
                DCD     App_Spurious_ISR                        ;  13 Reserved
                DCD     OS_CPU_PendSVHandler                    ;  14 PendSV Handler
                DCD     OS_CPU_SysTickHandler                   ;  15 SysTick Handler

                                                                ; External Interrupts
	
				DCD     GPIOPortA_Handler           ; GPIO Port A
				DCD     GPIOPortB_Handler           ; GPIO Port B
				DCD     GPIOPortC_Handler           ; GPIO Port C
				DCD     GPIOPortD_Handler           ; GPIO Port D
				DCD     GPIOPortE_Handler           ; GPIO Port E
				DCD     UART0_Handler               ; UART0 Rx and Tx
				DCD     UART1_Handler               ; UART1 Rx and Tx
				DCD     SSI0_Handler                ; SSI0 Rx and Tx
				DCD     I2C0_Handler                ; I2C0 Master and Slave
				DCD     PWM0Fault_Handler           ; PWM 0 Fault
				DCD     PWM0Generator0_Handler      ; PWM 0 Generator 0
				DCD     PWM0Generator1_Handler      ; PWM 0 Generator 1
				DCD     PWM0Generator2_Handler      ; PWM 0 Generator 2
				DCD     Quadrature0_Handler         ; Quadrature Encoder 0
				DCD     ADC0Seq0_Handler            ; ADC0 Sequence 0
				DCD     ADC0Seq1_Handler            ; ADC0 Sequence 1
				DCD     ADC0Seq2_Handler            ; ADC0 Sequence 2
				DCD     ADC0Seq3_Handler            ; ADC0 Sequence 3
				DCD     WDT_Handler                 ; Watchdog
				DCD     Timer0A_Handler             ; Timer 0 subtimer A
				DCD     Timer0B_Handler             ; Timer 0 subtimer B
				DCD     Timer1A_Handler             ; Timer 1 subtimer A
				DCD     Timer1B_Handler             ; Timer 1 subtimer B
				DCD     Timer2A_Handler             ; Timer 2 subtimer A
				DCD     Timer2B_Handler             ; Timer 2 subtimer B
				DCD     Comp0_Handler               ; Analog Comp 0
				DCD     Comp1_Handler               ; Analog Comp 1
				DCD     Comp2_Handler               ; Analog Comp 2
				DCD     SysCtl_Handler              ; System Control
				DCD     FlashCtl_Handler            ; Flash Control
				DCD     GPIOPortF_Handler           ; GPIO Port F
				DCD     GPIOPortG_Handler           ; GPIO Port G
				DCD     GPIOPortH_Handler           ; GPIO Port H
				DCD     UART2_Handler               ; UART2 Rx and Tx
				DCD     SSI1_Handler                ; SSI1 Rx and Tx
				DCD     Timer3A_Handler             ; Timer 3 subtimer A
				DCD     Timer3B_Handler             ; Timer 3 subtimer B
				DCD     I2C1_Handler                ; I2C1 Master and Slave
				DCD     Quadrature1_Handler         ; Quadrature Encoder 1
				DCD     CAN0_Handler                ; CAN0
				DCD     CAN1_Handler                ; CAN1
				DCD     CAN2_Handler                ; CAN2
				DCD     Ethernet_Handler            ; Ethernet
				DCD     Hibernate_Handler           ; Hibernate
				DCD     USB0_Handler                ; USB0
				DCD     PWM0Generator3_Handler      ; PWM 0 Generator 3
				DCD     uDMA_Handler                ; uDMA Software Transfer
				DCD     uDMA_Error                  ; uDMA Error
				DCD     ADC1Seq0_Handler            ; ADC1 Sequence 0
				DCD     ADC1Seq1_Handler            ; ADC1 Sequence 1
				DCD     ADC1Seq2_Handler            ; ADC1 Sequence 2
				DCD     ADC1Seq3_Handler            ; ADC1 Sequence 3
				DCD     I2S0_Handler                ; I2S0
				DCD     ExtBus_Handler              ; External Bus Interface 0
				DCD     GPIOPortJ_Handler           ; GPIO Port J
				DCD     GPIOPortK_Handler           ; GPIO Port K
				DCD     GPIOPortL_Handler           ; GPIO Port L
				DCD     SSI2_Handler                ; SSI2 Rx and Tx
				DCD     SSI3_Handler                ; SSI3 Rx and Tx
				DCD     UART3_Handler               ; UART3 Rx and Tx
				DCD     UART4_Handler               ; UART4 Rx and Tx
				DCD     UART5_Handler               ; UART5 Rx and Tx
				DCD     UART6_Handler               ; UART6 Rx and Tx
				DCD     UART7_Handler               ; UART7 Rx and Tx
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     I2C2_Handler                ; I2C2 Master and Slave
				DCD     I2C3_Handler                ; I2C3 Master and Slave
				DCD     Timer4A_Handler             ; Timer 4 subtimer A
				DCD     Timer4B_Handler             ; Timer 4 subtimer B
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     0                           ; Reserved
				DCD     Timer5A_Handler             ; Timer 5 subtimer A
				DCD     Timer5B_Handler             ; Timer 5 subtimer B
				DCD     WideTimer0A_Handler         ; Wide Timer 0 subtimer A
				DCD     WideTimer0B_Handler         ; Wide Timer 0 subtimer B
				DCD     WideTimer1A_Handler         ; Wide Timer 1 subtimer A
				DCD     WideTimer1B_Handler         ; Wide Timer 1 subtimer B
				DCD     WideTimer2A_Handler         ; Wide Timer 2 subtimer A
				DCD     WideTimer2B_Handler         ; Wide Timer 2 subtimer B
				DCD     WideTimer3A_Handler         ; Wide Timer 3 subtimer A
				DCD     WideTimer3B_Handler         ; Wide Timer 3 subtimer B
				DCD     WideTimer4A_Handler         ; Wide Timer 4 subtimer A
				DCD     WideTimer4B_Handler         ; Wide Timer 4 subtimer B
				DCD     WideTimer5A_Handler         ; Wide Timer 5 subtimer A
				DCD     WideTimer5B_Handler         ; Wide Timer 5 subtimer B
				DCD     FPU_Handler                 ; FPU
				DCD     PECI0_Handler               ; PECI 0
				DCD     LPC0_Handler                ; LPC 0
				DCD     I2C4_Handler                ; I2C4 Master and Slave
				DCD     I2C5_Handler                ; I2C5 Master and Slave
				DCD     GPIOPortM_Handler           ; GPIO Port M
				DCD     GPIOPortN_Handler           ; GPIO Port N
				DCD     Quadrature2_Handler         ; Quadrature Encoder 2
				DCD     Fan0_Handler                ; Fan 0
				DCD     0                           ; Reserved
				DCD     GPIOPortP_Handler           ; GPIO Port P (Summary or P0)
				DCD     GPIOPortP1_Handler          ; GPIO Port P1
				DCD     GPIOPortP2_Handler          ; GPIO Port P2
				DCD     GPIOPortP3_Handler          ; GPIO Port P3
				DCD     GPIOPortP4_Handler          ; GPIO Port P4
				DCD     GPIOPortP5_Handler          ; GPIO Port P5
				DCD     GPIOPortP6_Handler          ; GPIO Port P6
				DCD     GPIOPortP7_Handler          ; GPIO Port P7
				DCD     GPIOPortQ_Handler           ; GPIO Port Q (Summary or Q0)
				DCD     GPIOPortQ1_Handler          ; GPIO Port Q1
				DCD     GPIOPortQ2_Handler          ; GPIO Port Q2
				DCD     GPIOPortQ3_Handler          ; GPIO Port Q3
				DCD     GPIOPortQ4_Handler          ; GPIO Port Q4
				DCD     GPIOPortQ5_Handler          ; GPIO Port Q5
				DCD     GPIOPortQ6_Handler          ; GPIO Port Q6
				DCD     GPIOPortQ7_Handler          ; GPIO Port Q7
				DCD     GPIOPortR_Handler           ; GPIO Port R
				DCD     GPIOPortS_Handler           ; GPIO Port S
				DCD     PWM1Generator0_Handler      ; PWM 1 Generator 0
				DCD     PWM1Generator1_Handler      ; PWM 1 Generator 1
				DCD     PWM1Generator2_Handler      ; PWM 1 Generator 2
				DCD     PWM1Generator3_Handler      ; PWM 1 Generator 3
				DCD     PWM1Fault_Handler           ; PWM 1 Fault

__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


